
   var mangas = [
      {'id':"恋愛", 'title': "サレタガワのブルー",
      'text':
      "これを読むと浮気の恐ろしさがすごくわかる。そして登場人物の女の人がサイコパスでビビります。"},

      {'id':"恋愛" , 'title': "掃除の妖精におまかせ！",
      'text' :
      "潔癖症の清掃会社の社長がどうなったらこの女の子と恋に落ちるの⁉と続きがどんどん気になってしまいます。"},

      {'id':"恋愛" , 'title': "パンプキンタイム",
      'text' :
      "ある日突然性別が変わってしまっていた(男→女)子が、小さい頃に幼馴染でチームメイトだった男の子に再開する‼"},
      
      {'id':"恋愛" , 'title': "ワンダフルデイズ",
      'text' :
      "これまた不思議なお話。夜になると犬になってしまう女・比奈と犬が大嫌いな男・陣内。すれ違いがたくさんあってもどかしいけど、2人とも可愛くてずっと見ていられる。"},
      
      {'id':"冒険" , 'title': "約束のネバーランド",
      'text' :
      "主要メンバー三人のバランスが良い。そして12歳にも満たない子供たちが危険な世界で必死に生きようとする姿に心を打たれる‼"},
      // 5
      {'id':"冒険" , 'title': "HUNTER × HUNTER",
      'text' :
      "素直で曲がったことが嫌いで誰よりも仲間思いな主人公・ゴンが旅の中で出会う多くの人たちの心を動かし、仲間たちと困難を乗り越えていく姿がめちゃめちゃ良い‼"},

      {'id':"戦闘" , 'title': "七つの大罪",
      'text' :
      "七つの大罪といわれる7人の大罪人を探す話。最初に出会う団長・メリオダスが変態だけどやるときはやるかっこいい人。"},

      {'id':"戦闘" , 'title': "結界師",
      'text' :
      "夜になると学校に妖(あやかし)と呼ばれる妖怪が出るのを主人公たちは退治するのが仕事。主人公がコーヒー牛乳とお菓子作りが大好きなところが可愛い。"},

      {'id':"学園" , 'title': "外見至上主義",
      'text' :
      "ある日、自分の体が2つになっている⁉(本当の体とイケメンの体)不良が多い話なのでケンカ多めですが主人公の周りにはいい子が多いですよ～。"},

      {'id':"学園" , 'title': "傷だらけの悪魔",
      'text' :
      "いじめの恐ろしさがわかる話。人にしたことは自分に返ってくるってことを思い知らされます..."},
 // 10
      {'id':"スポーツ\n(野球）" , 'title': "H2",
      'text' :
      "あだち充シリーズの中で一番のおすすめ！主人公・比呂とヒロイン・ひかりの恋の行方が気になる。ほろ苦いストーリー。もちろん野球のシーンもたくさんあります！"},

      {'id':"スポーツ\n(野球）" , 'title': "バトルスタディーズ",
      'text' :
      "中学気分のまま高校は野球の強豪に進学した主人公たちが、先輩たちに理不尽に怒られまくる。怒られる内容が行き過ぎな部分もあるが共感できることも多い(笑)"},

      {'id':"スポーツ(バレー)" , 'title': "神様のバレー",
      'text' :
      "ずば抜けてすごい選手がいるわけでもないチームが天才コーチの指導や作戦によって試合を勝ち抜いていく！スポーツは個人のすごさだけではないと思い知らされます‼"},
      
      {'id':"スポーツ\n(バレー)" , 'title': "ハリガネサービス",
      'text' :
      "主人公・下平はピンチサーバー。サーブを意図的に操れるサーブの天才。そのサーブで何度もチームを救う姿や、下平自身の壁を乗り越える姿が格好良い！"},
      
      {'id':"ギャグ" , 'title': "荒川アンダーザブリッジ",
      'text' :
      "主人公の周りにいるキャラ一人ひとりの個性が本当に強い。本当にクセが強くて変わった人ばかりで笑えます。"},
 // 15
      {'id':"ギャグ" , 'title': "ブラックナイトパレード",
      'text' :
      "主人公がコンビニバイトからサンタクロースに転職する！サンタクロースの裏側？を知ることができる。かも..."},

      {'id':"勉強" , 'title': "コウノドリ",
      'text' :
      "命の大切さがすごくわかる漫画です。人はそれぞれ色んな事情を抱えて生きているんだなあと実感する。"},

      {'id':"勉強" , 'title': "はたらく細胞",
      'text' :
      "体の中のこと(赤血球とか血小板とか)をとってもわかりやすく面白く書いてくれています。"},
      
      {'id':"塔を上る" , 'title': "リセットゲーム",
      'text' :
      "ある日突然塔に入れられた主人公たちは塔から脱出するために出題される謎を解いて先を目指していく。自分たちでも解けそうな謎が出て来るので読みごたえがある。"},
      
      {'id':"塔を上る" , 'title': "神之塔",
      'text' :
      "ずっと塔の中で生活してきた主人公・夜が好きな子・ラヘルの空を見てみたいという願いのために塔の頂上を目指していく。夜の秘めたる力がどんなものなのかどんどん気になってきてしまう！"},
      // 20
      {'id':"料理" , 'title': "パパと親父のウチのご飯",
      'text' :
      "2組のシングルファザーがシェアハウスをする。育児に苦戦するも料理を通して子供たちと心を通じ合うシーンがほっこりします！"},
      
      {'id': "アイドル" , 'title': "AKB49",
      'text' :
      "好きな女の子を追いかけて男の子がアイドルになってしまう(普通じゃあり得ない)。実際にいたメンバー達のことも書かれているので読みごたえはあります！"}
   ];

   var animes =[
      { 'id' : "恋愛" , 'title' : "四月は君の嘘" ,
      'text' : 
      "中学生の天才ピアニストとヴァイオリニストの音楽を中心とした恋の物語。終わった時にはピアノが弾きたくなります。とても儚く、感動する話で最終回は何度見ても泣けます。"},

      { 'id' : "恋愛" , 'title' : "ヲタクに恋は難しい" , 
      'text' : 
      "物語の中心メンバー4人は何かしらのヲタク(熱狂的ファン)。そんな4人の日常や恋模様を時に面白く、時に不器用に、そして時にヲタク目線で描かれている。"},

      { 'id' : "恋愛" , 'title' : "恋と嘘", 
      'text' :
      "国が決めた相手と結婚しなければいけない世界。主人公は国が決めた相手ではない人と両思いになってしまう。果たしてその恋の行方は…" },

      { 'id' : "冒険" , 'title' : "Re:ゼロから始める\n異世界生活",
      'text' : 
      "主人公が死ぬと時間が戻ってしまう不思議な異世界。戦闘能力もなく魔法も使えないちょっと根性の曲がった主人公が時間を進めようと奮闘する姿がよかったりする。" },

      { 'id' : "冒険" , 'title' : "甲鉄城のカバネリ",
      'text' :
      "ゾンビに似た鋼鉄の心臓を貫かないと死なない怪物（カバネ）が存在する世界。カバネに立ち向かう主人公の格好良さと噛まれたらカバネになってしまう危険との闘いが良い。"},

      { 'id' : "戦闘" , 'title' : "ソードアートオンライン",
      'text' :
      "VRゲームに実際にダイブして戦う話。シリーズによってゲームの舞台や設定も変わってくる。VRゲームをやってみたくなる。あと主人公が無駄にモテる。" },

      { 'id' : "戦闘" , 'title' : "犬夜叉",
      'text' :
      "手にすれば最強になれるといわれている四魂の玉を集めていく話で、同じく四魂の玉を狙う奈落というボスを倒そうとする旅の話でもある。人と妖怪が一緒に旅をしてるのがなんか良い。" },

      { 'id' : "スポーツ\n(野球）" , 'title' : "メジャー2nd",
      'text' :
      "王道野球アニメのJr.シリーズ！平凡な野球少年の主人公・茂野大吾が様々な人から野球を学び努力で上手くなっていくところが良い。野球女子が出てくるところもおすすめポイント！" },

      { 'id' : "スポーツ\n(野球）" , 'title' : "ダイヤのA",
      'text' :
      "甲子園に出るためにひたすら野球と向き合う登場人物たちが格好良い。すごすぎてリアリティがないシーンもありますが野球を知らない人が見ても面白いと思う！" },

      { 'id' : "スポーツ\n(バレー)" , 'title' : "ハイキュー",
      'text' :
      "バレーのこと全く分からない私が見てもはまりました。チームスポーツの良さがめちゃめちゃ詰まっています！！バレーがやりたくなる‼" },

      { 'id' : "ギャグ" , 'title' : "ぐらんぶる",
      'text':
      "ひたすらお酒飲んで野球拳している大学生達の話。くだらなくて笑えます。一応ダイビングサークルなのでごく稀にすごくきれいな海が出てくるのがギャップで心が浄化されます...(笑)" },

      { 'id' : "ギャグ" , 'title' : "ボボボーボ・ボーボボ" ,
      'text':
      "とにかく登場人物の名前と個性が強すぎる。主人公は鼻毛で戦います。作品内にはバトルシーンもたくさんあるけれど圧倒的にギャグの部分が勝ちます。"},

      { 'id' : "勉強" , 'title' : "Dr.STONE",
      'text' :
      "主に科学のお話。ある日突然地球の生物が石化し技術が滅び文明も石器時代まで戻ってしまう。火も鉄もすべて一から、あり得ないものも科学の力で作ってしまう主人公がとにかくすごい‼" },

      { 'id' : "近未来" , 'title' : "PSYCHO-PASS サイコパス",
      'text' :
      "人が犯罪を犯す可能性が数値(犯罪計数)になって現れるようになった時代。その世界を取り締まる警察官達の話。本当にこんな時代がいつか訪れそう。"},

      { 'id' : "近未来" , 'title' : "電脳コイル",
      'text' :
      "携帯の代わりに眼鏡にすべてが埋め込まれている。電話もネットもめがねでできる。未来の話だけれど絵が昔っぽいのが良い。そして話に出てくるペットが可愛い。" },

      { 'id' : "料理" , 'title' : "真・中華一番",
      'text' :
      "料理アニメなのでとにかく食べ物がおいしそうに書かれている。本当に作れるのか分からない料理もたまに出てくるが見てるとおなかがすいてきます。"},

      { 'id' : "料理" , 'title' : "たくのみ",
      'text' :
      "タイトルの通り主にお酒のお話。色んなお酒についてわかりやすく説明をしてくれるのでお酒の勉強になります。一話15分なのでとにかく見やすい！" },

      { 'id' : "アイドル" , 'title' : "推しが武道館いってくれたら死ぬ",
      'text' :
      "アイドルの話。というよりもアイドルを追いかけるヲタクのお話。ヲタク同士の会話のやり取りがとにかく面白い。推しに忠実でとても可愛い。" },
   ];
   
   var genre = [
      {'chref' : "comickoi.html" , 'ahref' : "animekoi.html" , 'genr' : "恋愛" , 'src' : "img/love.png"},
      {'chref' : "comicbouken.html" , 'ahref' : "animebouken.html" , 'genr' : "冒険" , 'src' : "img/bouken.png"},
      {'chref' : "comicsentou.html" , 'ahref' : "animesentou.html" , 'genr' : "戦闘" , 'src' : "img/buki.png"},
      {'chref' : "comicsport.html" , 'ahref' : "animesuports.html" , 'genr' : "スポーツ" , 'src' : "img/suport.png"},
      {'chref' : "comicstudy.html" , 'ahref' : "animestudy.html" , 'genr' : "勉強" , 'src' : "img/study.png"},
      {'chref' : "comicgyag.html" , 'ahref' : "animegyagu.html" , 'genr' : "ギャグ" , 'src' : "img/warai.png"},
      {'chref' : "comiccook.html" , 'ahref' : "animecook.html" , 'genr' : "料理" , 'src' : "img/cook.png"},
      {'chref' : "comicaidl.html" , 'ahref' : "animeaidol.html" , 'genr' : "アイドル" , 'src' : "img/aidol.png"},
      {'chref' : "comictou.html" , 'genr' : "塔を上る" , 'src' : "img/kaidann.jpg"},
      {'chref' : "comicgakuen.html" , 'genr' : "学園" , 'src' : "img/gakkou.png"},
      {'ahref' : "animefuture.html" , 'genr' : "近未来" , 'src' : "img/mirai.jpg"},
   ];

   class Sakuhin {
      constructor(am, id, title, src, text){
        this.am = am;
        this.id = id;
        this.title = title;
        this.src = src;
        this.text = text;
      }

      
      
      getSetText(){
         var osusume = document.createElement("p");      
         var daimei = document.createElement("h1");      
         var desu = document.createElement("p");      
         var shashin = document.createElement("img");      
         var kansou = document.createElement("p");
         osusume.textContent = `あなたにおすすめの${this.id}${this.am}は…` ;
         daimei.textContent = `「${this.title}」`;
         desu.textContent = "です！！"
         shashin.src = this.src;
         shashin.classList.add("animes-img");
         kansou.textContent = this.text;
         kansou.classList.add("anime-text");
         return{osusume, daimei, desu, shashin, kansou}
      }

   }
   
   
