{
var mangas = [
   {'id':"恋愛", 'title': "サレタガワのブルー"},
   {'id':"恋愛" , 'title': "掃除の妖精におまかせ！"},
    {'id':"恋愛" , 'title': "パンプキンタイム"},
    {'id':"恋愛" , 'title': "ワンダフルデイズ"},
    {'id':"冒険" , 'title': "約束のネバーランド"},
    {'id':"冒険" , 'title': "HUNTER × HUNTER"},
    {'id':"戦闘" , 'title': "七つの大罪"},
    {'id':"戦闘" , 'title': "結界師"},
    {'id':"学園" , 'title': "外見至上主義"},
    {'id':"学園" , 'title': "傷だらけの悪魔"},
    {'id':"スポーツ\n(野球）" , 'title': "H2"},
    {'id':"スポーツ\n(野球）" , 'title': "バトルスタディーズ"},
    {'id':"スポーツ(バレー)" , 'title': "神様のバレー"},
    {'id':"スポーツ\n(バレー)" , 'title': "ハリガネサービス"},
    {'id':"ギャグ" , 'title': "荒川アンダーザブリッジ"},
    {'id':"ギャグ" , 'title': "ブラックナイトパレード"},
    {'id':"勉強" , 'title': "コウノドリ"},
    {'id':"勉強" , 'title': "はたらく細胞"},
    {'id':"塔を上る" , 'title': "リセットゲーム"},
    {'id':"塔を上る" , 'title': "神之塔"},
    {'id':"料理" , 'title': "パパと親父のウチのご飯"},
   {'id': "アイドル" , 'title': "AKB49" }
];

var animes =[
    { 'id' : "恋愛" , 'title' : "四月は君の嘘" },
    { 'id' : "恋愛" , 'title' : "ヲタクに恋は難しい" },
    { 'id' : "恋愛" , 'title' : "恋と嘘" },
    { 'id' : "冒険" , 'title' : "Re:ゼロから始める\n異世界生活" },
    { 'id' : "冒険" , 'title' : "甲鉄城のカバネリ" },
    { 'id' : "戦闘" , 'title' : "ソードアートオンライン" },
    { 'id' : "戦闘" , 'title' : "犬夜叉" },
    { 'id' : "スポーツ\n(野球）" , 'title' : "メジャー2nd" },
    { 'id' : "スポーツ\n(野球）" , 'title' : "ダイヤのA" },
    { 'id' : "スポーツ\n(バレー)" , 'title' : "ハイキュー" },
    { 'id' : "ギャグ" , 'title' : "ぐらんぶる" },
    { 'id' : "ギャグ" , 'title' : "ボボボーボ・ボーボボ" },
    { 'id' : "勉強" , 'title' : "Dr.STONE" },
    { 'id' : "近未来" , 'title' : "PSYCHO-PASS\nサイコパス" },
    { 'id' : "近未来" , 'title' : "電脳コイル" },
    { 'id' : "料理" , 'title' : "真・中華一番" },
    { 'id' : "料理" , 'title' : "たくのみ" },
    { 'id' : "アイドル" , 'title' : "推しが武道館いってくれたら死ぬ" },
 ];

}